#+TITLE: Introduction to Emacs
#+STARTUP: showall

Emacs is a powerful text editor. You will use it in this course to read course notes, and to complete assignments. Emacs will enable us to do some amazing things throughout the semester. Emacs can be as much as you need in an editor. You will not learn everything it can do at once, and you should not try to. These notes are here so you can refer back to them. Over time, and when you need to, you will learn it. I have, for example, been using Emacs for about 15 year years now. I continue to learn new things about it. It has, afterall, been developed now for approximately 40 years, by a lot of very bright people!

You might wonder, do I have to use Emacs? The answer is yes. Some people say, "But I am a vim user ;(". You should learn how to make Emacs look like Vim (google viper-mode). Vim cannot do what Emacs does in this class. Nothing but Emacs can do what Emacs does in this class. Do not waste time trying to find a way around it.

As you begin to use Emacs, you should rely on the menus to perform operations like opening and closing files, copying and pasting, etc... In the menus you will see for some commands keyboard short cuts. You do not have to use these or learn them, but it will make some things faster. There is an extensive manual for Emacs [fn:1]. You do not need to read this, but you may find helpful information there.

** Code
One of the most important reasons we use org-mode is because we can write code inside our documents, and run the code to get the output. We will almost always use Python for this. We have to designate a section of text as a "code block". We do this by having lines that start with #+BEGIN_SRC python and #+END_SRC. The lines between them make up the code. We can run the code by putting our cursor inside the block and pressing C-c C-c. Memorize that. You will do it a lot.

#+BEGIN_SRC python
print 'Hello world'
#+END_SRC

#+RESULTS:
: Hello world

You can learn much more about what is possible here: http://orgmode.org/org.html#Working-With-Source-Code

